Revit 2027 API
ViewDisplayBackground.ImageFlags Property
 The image alignment indicators when the type is 'Image'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDisplayBackgroundImageFlags ImageFlags { get; }
Public ReadOnly Property ImageFlags As ViewDisplayBackgroundImageFlags
	Get
public:
property ViewDisplayBackgroundImageFlags ImageFlags {
	ViewDisplayBackgroundImageFlags get ();
}
member ImageFlags : ViewDisplayBackgroundImageFlags with get
Property Value
ViewDisplayBackgroundImageFlags
See Also
Reference
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace